Repository: alextavares/nutriz
Catalog: lib/l10n/app_*.arb
Languages: pt

# unexpectedErrorMessage
source: Unexpected error: {error}
pt: Erro inesperado: {error}

# dataSourceQA
source: Show data source (OFF/FDC/NLQ)
pt: Mostrar fonte dos dados (OFF/FDC/NLQ)

source: QA / Debugging
pt: QA / Depuração

# achievementsStreaksCleared
source: Achievements and streaks cleared
pt: Conquistas e streaks limpos

source: Clear achievements/streaks
pt: Limpar conquistas/streaks

source: Test badge granted
pt: Badge de teste concedido

source: Grant test badge
pt: Conceder badge de teste

# recalculateStreaks60
source: Recalculate streaks (60 days)
pt: Recalcular streaks (60 dias)

source: Recalculate perfect week
pt: Recalcular semana perfeita

source: Test celebration
pt: Testar celebração

source: Preference saved
pt: Preferência salva

# aiCacheNormalization
source: AI Cache (food normalization)
pt: Cache de IA (normalização de alimentos)

source: Chips updated
pt: Chips atualizados

source: AI cache cleared
pt: Cache de IA limpo

source: AI cache copied
pt: Cache de IA copiado

source: AI cache imported
pt: Cache de IA importado

# invalidJSON
source: Invalid JSON: {error}
pt: JSON inválido: {error}

source: Meal goals saved!
pt: Metas por refeição salvas!

# dataSource
source: Show data source (OFF/FDC/NLQ)
pt: Mostrar fonte dos dados (OFF/FDC/NLQ)

source: ME
pt: EU

source: Free Plan
pt: Plano Gratuito

source: PRO Subscription
pt: Assinatura PRO

source: Daily Goals
pt: Metas Diárias

# logoutAccount
source: Log out of account?
pt: Sair da conta?

# logoutConfirmMessage
source: You will need to log in again. To confirm, type: LOGOUT
pt: Você precisará fazer login novamente. Para confirmar, digite: SAIR

source: Intelligent reports
pt: Relatórios inteligentes

source: Guided plans
pt: Planos guiados

source: Barcode scanner
pt: Scanner de código de barras

# proDescription
source: Customize meals, receive smart alerts and access the complete library of exclusive recipes.
pt: Personalize refeições, receba alertas inteligentes e acesse a biblioteca completa de receitas exclusivas.

source: Meet NutriTracker PRO
pt: Conheça o NutriTracker PRO

# plansStartingAt
source: Plans starting at $14.99/month · Cancel anytime
pt: Planos a partir de R$ 14,99/mês · Cancele quando quiser

source: You are PRO!
pt: Você é PRO!

# proEnjoyMessage
source: Enjoy all advanced features of NutriTracker. New recipes and plans arrive every week.
pt: Aproveite todos os recursos avançados do NutriTracker. Novas receitas e planos chegam toda semana.

source: Advanced insights
pt: Insights avançados

source: Dynamic plans
pt: Planos dinâmicos

source: PRO Recipes
pt: Receitas PRO

# proSubscriptionActivated
source: PRO subscription activated successfully!
pt: Assinatura PRO ativada com sucesso!

# unexpectedError
source: Unexpected error: {error}
pt: Erro inesperado: {error}

source: Terminate PRO
pt: Encerrar PRO

# terminateProConfirmMessage
source: This action is only available for testing. Confirm cancellation of PRO subscription?
pt: Essa ação está disponível apenas para testes. Confirmar cancelamento da assinatura PRO?

# connectWithFriends
source: Connect with friends to compare progress. Coming soon.
pt: Conecte-se com amigos para comparar progresso. Em breve.

source: Goal reached!
pt: Meta atingida!

source: No variation yet
pt: Sem variação ainda

# youGainedWeight
source: You gained {weight} kg
pt: Você ganhou {weight} kg

# youLostWeight
source: You lost {weight} kg
pt: Você perdeu {weight} kg

# defineWeightGoalMessage
source: Define your weight goal to track the bar
pt: Defina sua meta de peso para acompanhar a barra

source: Weight goal (kg)
pt: Meta de peso (kg)

source: Starting weight (kg)
pt: Peso inicial (kg)

source: Weight objective
pt: Objetivo de peso

# goalsUpdatedSuccess
source: Goals updated
pt: Objetivos atualizados

source: Reduced animations
pt: Animações reduzidas

source: Normal animations
pt: Animações normais

# showConfettiOnBadges
source: Show confetti when unlocking badges
pt: Mostra confete ao desbloquear badges

# showNextMilestoneDescription
source: Shows '• next: Nd' in streak chips
pt: Mostra '• próx: Nd' nos chips de streak

# interpretQuantitiesInText
source: Interpret quantities in text (NLQ)
pt: Interpretar quantidades no texto (NLQ)

# quantitiesExample
source: Ex.: '150g chicken', '2 eggs and 1 banana'
pt: Ex.: '150g frango', '2 ovos e 1 banana'

# mealGoalsPerMeal
source: Goals per meal
pt: Metas por refeição

# fatGrams
source: Fat (g)
pt: Gord. (g)

# saveMealGoals
source: Save goals
pt: Salvar metas

source: Meal goals cleared
pt: Metas por refeição limpas

# clearMealGoalsConfirm
source: Clear meal goals?
pt: Limpar metas por refeição?

# clearMealGoalsMessage
source: This action resets the goals for Breakfast, Lunch, Dinner and Snacks. To confirm, type: CONFIRM
pt: Esta ação zera as metas de Café, Almoço, Jantar e Lanches. Para confirmar, digite: CONFIRMAR

# diaryExported
source: Diary exported to clipboard
pt: Diário exportado para a área de transferência

# exportFailed
source: Export failed: {error}
pt: Falha ao exportar: {error}

# importDiary
source: Import Diary (JSON)
pt: Importar Diário (JSON)

# diaryImported
source: Diary imported successfully
pt: Diário importado com sucesso

# templatesExported
source: Templates copied to clipboard
pt: Templates copiados para a área de transferência

# exportTemplatesFailed
source: Failed to export templates: {error}
pt: Falha ao exportar templates: {error}

# importTemplates
source: Import Templates (JSON)
pt: Importar Templates (JSON)

# templatesImported
source: Templates imported successfully
pt: Templates importados com sucesso

# foodsExported
source: Foods copied to clipboard
pt: Alimentos copiados para a área de transferência

# exportFoodsFailed
source: Failed to export foods: {error}
pt: Falha ao exportar alimentos: {error}

# importFoods
source: Import Foods (JSON)
pt: Importar Alimentos (JSON)

# foodsImported
source: Foods imported successfully
pt: Alimentos importados com sucesso

source: Foods cleared
pt: Alimentos limpos

# clearAllFoodsConfirm
source: Clear all foods?
pt: Limpar todos os alimentos?

# clearAllFoodsMessage
source: This action removes Favorites and My Foods. Cannot be undone. To confirm, type: CLEAR
pt: Esta ação remove Favoritos e Meus Alimentos. Não pode ser desfeita. Para confirmar, digite: LIMPAR

source: Templates cleared
pt: Templates limpos

# clearAllTemplatesConfirm
source: Clear all templates?
pt: Limpar todos os templates?

# clearAllTemplatesMessage
source: This action removes all day and week templates. Cannot be undone. To confirm, type: CLEAR
pt: Esta ação remove todos os templates de dia e semana. Não pode ser desfeita. Para confirmar, digite: LIMPAR

source: Import AI Cache (JSON)
pt: Importar Cache de IA (JSON)

source: Water
pt: Água

source: Activities
pt: Atividades

source: Walking
pt: Caminhada

source: Running
pt: Corrida

source: Cycling
pt: Bike

# navFasting
source: Fasting
pt: Jejum

# navRecipes
source: Recipes
pt: Receitas

source: Eaten
pt: Consumido

source: Remaining
pt: Restante

source: Burned
pt: Queimado

source: Nutrition
pt: Nutrição

source: Day actions
pt: Ações do dia

source: Statistics
pt: Estatísticas

source: More actions
pt: Mais ações

# walkingMinutes
source: Walking {minutes}m
pt: Caminhada {minutes}m

# runningMinutes
source: Running {minutes}m
pt: Corrida {minutes}m

# cyclingMinutes
source: Cycling {minutes}m
pt: Bike {minutes}m

source: Macronutrients
pt: Macronutrientes

source: Goals
pt: Metas

source: Adjust macro goals
pt: Ajustar metas de macros

source: Macro goals updated
pt: Metas de macros atualizadas

source: Intermittent Fasting
pt: Jejum Intermitente

source: Fasting schedules
pt: Horários de jejum

# eatingWindow
source: Eating window: {stop} - {start}
pt: Janela de alimentação: {stop} - {start}

# fastingMethod168
source: 16:8 Method
pt: Método 16:8

# fastingMethod186
source: 18:6 Method
pt: Método 18:6

# fastingMethod204
source: 20:4 Method
pt: Método 20:4

# fastingMethodLabel
source: Method {method}
pt: Método {method}

# timezone
source: Timezone: {timezone}
pt: Fuso: {timezone}

# endsAt
source: Ends at {time}
pt: Termina às {time}

# fastingDays
source: {days}d fasting
pt: {days}d jejum

source: No fasting streak
pt: Sem streak jejum

source: Define custom method
pt: Definir método personalizado

source: Fasting duration
pt: Duração do jejum

source: Minutes
pt: Minutos

# fastStarted
source: Fast started! Method {method}
pt: Jejum iniciado! Método {method}

# fastCompleted
source: Fast completed! Duration: {hours}h {minutes}min
pt: Jejum finalizado! Duração: {hours}h {minutes}min

source: Congratulations!
pt: Parabéns!

# fastCompletedSuccess
source: You completed your {method} fast successfully! 🎉
pt: Você completou seu jejum {method} com sucesso! 🎉

# notificationsMutedUntil
source: Notifications muted until {time}
pt: Notificações silenciadas até {time}

source: Reactivate
pt: Reativar

source: Stop current fast to change method
pt: Finalize o jejum atual para alterar o método

# fastingOfDay
source: Fast of {date}
pt: Jejum de {date}

# duration
source: Duration: {hours}h
pt: Duração: {hours}h

source: Fast completed successfully
pt: Jejum completado com sucesso

# remindersMuted24h
source: Reminders muted for 24h
pt: Lembretes silenciados por 24h

source: Reminders reactivated
pt: Lembretes reativados

# remindersMutedTomorrow
source: Reminders muted until tomorrow 08:00
pt: Lembretes silenciados até amanhã 08:00

# startFastButton
source: Start fasting
pt: Iniciar jejum

# endFastButton
source: End fast
pt: Encerrar jejum
