Repository: alextavares/nutriz
Catalog: lib/l10n/app_*.arb
Languages: pt

# streakOverviewTitle
source: Streak Overview
pt: Visão geral da sequência

# streakCurrentLabel
source: Current streak
pt: Sequência atual

# streakDays
source: {count} days
pt: {count} dias

# streakNoStreak
source: No streak yet
pt: Sem sequência

# streakLogFood
source: Log food
pt: Registrar alimento

# streakMilestonesTitle
source: Milestones
pt: Marcos

# streakDayProgress
source: Day {current}/{next}
pt: Dia {current}/{next}

# streakGoalCompleted
source: Goal completed
pt: Meta concluída

# streakWeeklyOverviewTitle
source: Weekly overview
pt: Visão semanal

# streakLongestTitle
source: Longest streak
pt: Maior sequência

# weekMon
source: Mon
pt: Seg

# weekTue
source: Tue
pt: Ter

# weekWed
source: Wed
pt: Qua

# weekThu
source: Thu
pt: Qui

# weekFri
source: Fri
pt: Sex

# weekSat
source: Sat
pt: Sáb

# weekSun
source: Sun
pt: Dom

source: Got it
pt: Entendi

# streakNuxBody
source: Tap the dots to jump to a specific day Your streak grows when you log any food entry for the day.
pt: Toque nos pontos para ir a um dia específico. Sua sequência cresce quando você registra qualquer alimento no dia.

# achievementsTitle
source: Achievements
pt: Conquistas

# achievementsTabAll
source: All
pt: Todas

# achievementsTabWater
source: Water
pt: Água

# achievementsTabFasting
source: Fasting
pt: Jejum

# achievementsTabCalories
source: Calories
pt: Calorias

# achievementsTabProtein
source: Protein
pt: Proteína

# achievementsTabFood
source: Food
pt: Alimentos

# achievementsTabTest
source: Test
pt: Teste

# achievementsTabFavorites
source: Favorites
pt: Favoritos

# achievementsListView
source: List view
pt: Ver em lista

# achievementsGridView
source: Grid view
pt: Ver em grade

# achievementsEmpty
source: No achievements yet
pt: Sem conquistas ainda

# achievementsDefaultTitle
source: Achievement
pt: Conquista

# achievementsType
source: Type
pt: Tipo

# achievementsGoal
source: Goal
pt: Meta

# achievementsNewBadge
source: New
pt: Novo

# achievementsFavorite
source: Favorite
pt: Favoritar

# achievementsRemoveFavorite
source: Remove favorite
pt: Remover dos favoritos

# filterTypeLabel
source: Type
pt: Tipo

# filterTypeAll
source: All
pt: Todos

# filterTypeSuccess
source: Success
pt: Sucesso

# filterTypeGeneral
source: General
pt: Genérico

# filterGoalLabel
source: Goal
pt: Meta

# filterGoalAll
source: All
pt: Todas

# filterGoalWater
source: Water
pt: Água

# filterGoalFasting
source: Fasting
pt: Jejum

# filterGoalCalories
source: Calories
pt: Calorias

# filterGoalProtein
source: Protein
pt: Proteína

# filterGoalFood
source: Food
pt: Alimentos

# filterGoalTest
source: Test
pt: Teste

# filterSortLabel
source: Sort
pt: Ordenar

# sortRecent
source: Recent
pt: Recentes

# sortOldest
source: Oldest
pt: Antigas

# sortType
source: Type
pt: Tipo

# navDiary
source: Diary
pt: Diário

# navSearch
source: Search
pt: Buscar

# navAdd
source: Add
pt: Adicionar

# navProgress
source: Progress
pt: Progresso

# navProfile
source: Profile
pt: Perfil

# addSheetAddFood
source: Add food
pt: Adicionar alimento

# addSheetAddBreakfast
source: Add to Breakfast
pt: Adicionar ao Café da manhã

# addSheetAddLunch
source: Add to Lunch
pt: Adicionar ao Almoço

# addSheetAddDinner
source: Add to Dinner
pt: Adicionar ao Jantar

# addSheetAddSnacks
source: Add to Snacks
pt: Adicionar aos Lanches

# addSheetAddWater250
source: Add water (+250 ml)
pt: Adicionar Água (+250 ml)

# addSheetAddedWater250
source: Added 250 ml of water
pt: Adicionado 250 ml de Água

# addSheetAddWater500
source: Add water (+500 ml)
pt: Adicionar Água (+500 ml)

# addSheetAddedWater500
source: Added 500 ml of water
pt: Adicionado 500 ml de Água

# addSheetFoodScanner
source: Food Scanner/AI
pt: Scanner/IA de alimento

# addSheetExploreRecipes
source: Explore recipes
pt: Explorar receitas

# addSheetIntermittentFasting
source: Intermittent fasting
pt: Jejum intermitente

# appbarPrevDay
source: Previous day
pt: Dia anterior

# appbarToday
source: Today
pt: Hoje

# appbarToggleDashboardOriginal
source: Original Dashboard
pt: Dashboard Original

# appbarGamificationTooltip
source: Gamification
pt: Gamificação

# appbarGamificationSoon
source: Gamification coming soon
pt: Gamificação em breve

# appbarStreakTooltip
source: Streaks
pt: Sequência

# appbarStreakSoon
source: Streaks/Achievements coming soon
pt: Sequência/Conquistas em breve

# appbarStatisticsTooltip
source: Statistics
pt: Estatísticas

# appbarSelectDate
source: Select date
pt: Selecionar data

# splashUnexpectedError
source: Unexpected error during initialization
pt: Erro inesperado durante a inicialização

# splashForceUpdateTitle
source: Update Required
pt: Atualização Necessária

# splashForceUpdateBody
source: A new version of NutriTracker is available. Please update the app to continue.
pt: Uma nova versão do NutriTracker está disponível. Por favor, atualize o aplicativo para continuar.

# splashUpdate
source: Update
pt: Atualizar

# splashUnknownError
source: Unknown error
pt: Erro desconhecido

# splashRetry
source: Try Again
pt: Tentar Novamente

# versionLabel
source: Version {version}
pt: Versão {version}

# dowMon
source: Monday
pt: Segunda-feira

# dowTue
source: Tuesday
pt: Terça-feira

# dowWed
source: Wednesday
pt: Quarta-feira

# dowThu
source: Thursday
pt: Quinta-feira

# dowFri
source: Friday
pt: Sexta-feira

# dowSat
source: Saturday
pt: Sábado

# dowSun
source: Sunday
pt: Domingo

# dashboardTitle
source: Dashboard
pt: Painel

# dashboardQuickActions
source: Quick Actions
pt: Ações Rápidas

# dashboardTodaysMeals
source: Today's Meals
pt: Refeições de Hoje

# dashboardViewAll
source: View All
pt: Ver Todas

# dashboardAddMeal
source: Add Meal
pt: Adicionar Refeição

# streakNext
source: • next: {next}d
pt: → próx: {next}d

# badgeEarnedOn
source: Earned on: {date}
pt: Obtida em: {date}

source: Close
pt: Fechar

# weeklyProgressTitle
source: Weekly Progress
pt: Progresso semanal

source: Save week as template
pt: Salvar semana como template

source: Apply week template
pt: Aplicar template de semana

source: Duplicate week → next
pt: Duplicar semana → próxima

source: Duplicate week → pick date
pt: Duplicar semana → escolher data

source: Install app
pt: Instalar app

source: Calories per day
pt: Calorias por dia

# daysWithNew
source: {count} day(s) with new items
pt: {count} dia(s) com itens novos

# perMealAverages
source: Per-meal averages (kcal/day)
pt: Médias por refeição (kcal/dia)

source: Weekly macro averages
pt: Médias semanais de macros

source: Carbs (avg)
pt: Carboidratos (média)

source: Protein (avg)
pt: Proteína (média)

source: Fat (avg)
pt: Gordura (média)

source: Water per day
pt: Água por dia

source: Exercise per day
pt: Exercício por dia

source: Daily summary
pt: Resumo diário

# mealBreakfast
source: Breakfast
pt: Café

# mealLunch
source: Lunch
pt: Almoço

# mealDinner
source: Dinner
pt: Jantar

# mealSnack
source: Snack
pt: Lanche

# weekCsvCopied
source: Week CSV copied/shared
pt: CSV da semana copiado/compartilhado

source: File name
pt: Nome do arquivo

# fileHint
source: file.csv
pt: arquivo.csv

source: Cancel
pt: Cancelar

source: Save
pt: Salvar

# templateApplied
source: Template applied to day
pt: Template aplicado ao dia

source: Duplicate → tomorrow
pt: Duplicar → amanhã

source: Week actions
pt: Ações da semana

# hdrDate
source: Date
pt: Data

# hdrWater
source: Water
pt: Água

# hdrExercise
source: Exer.
pt: Exerc.

# hdrFat
source: Fat
pt: Gord

source: Over goal
pt: Excedeu

# onbWelcome
source: Welcome
pt: Bem-vindo

# onbInfoTitle
source: It's okay to be imperfect
pt: Tudo bem não ser perfeito

# onbInfoBody
source: We will build habits gradually. Focus on consistency, not perfection.
pt: Vamos construir hábitos aos poucos. Foque na consistência, não na perfeição.

# continueLabel
source: Continue
pt: Continuar

# finishLabel
source: Finish
pt: Concluir

# onbCommitToday
source: Commitment marked for today
pt: Compromisso marcado para hoje

source: Day Streak
pt: Sequência de dias

# onbCongratsStreak
source: Great! You started your streak. Keep it up!
pt: Parabéns, você começou seu streak. Mantenha o ritmo!

# onbImCommitted
source: I'm committed
pt: Estou comprometido

source: Goals set
pt: Metas definidas

# defineGoalsTitle
source: Set your goals
pt: Defina suas metas

# defineGoalsBody
source: Adjust calories and macros to your target. You can change later.
pt: Ajuste calorias e macros para o seu objetivo. Você pode alterar depois.

source: Open goals wizard
pt: Abrir assistente de metas

source: Notifications configured
pt: Notificações configuradas

source: Reminders saved
pt: Lembretes salvos

# remindersTitle
source: Reminders & Notifications
pt: Lembretes e Notificações

# remindersBody
source: Enable hydration reminders to help daily consistency. You can change this later in settings.
pt: Ative lembretes de hidratação para ajudar na consistência diária. Você pode alterar nas configurações depois.

source: Enable hydration reminders
pt: Ativar lembretes de hidratação

# intervalMinutes
source: Interval (min)
pt: Intervalo (min)

source: Requesting…
pt: Solicitando...

source: Allow notifications
pt: Permitir notificações

# recipesTitle
source: Recipes
pt: Receitas

# recipesEmptyFiltered
source: No recipes found
pt: Nenhuma receita encontrada

# recipesLoadingTitle
source: Loading recipes...
pt: Carregando receitas...

# recipesEmptySubtitle
source: Try adjusting your filters or search term
pt: Tente ajustar seus filtros ou termo de busca

# recipesLoadingSubtitle
source: Please wait while we load the best recipes for you
pt: Aguarde enquanto carregamos as melhores receitas para você

source: Clear filters
pt: Limpar Filtros

source: Refresh
pt: Atualizar

source: Recipe added to favorites
pt: Receita adicionada aos favoritos

source: Recipe removed from favorites
pt: Receita removida dos favoritos

# openingRecipe
source: Opening recipe: {name}
pt: Abrindo receita: {name}

# addedToMealPlan
source: {name} added to meal plan
pt: {name} adicionada ao plano de refeições

# sharingRecipe
source: Sharing recipe: {name}
pt: Compartilhando receita: {name}

# findingSimilar
source: Finding recipes similar to: {name}
pt: Buscando receitas similares a: {name}

# qaAddToMealPlan
source: Add to Meal Plan
pt: Adicionar ao Plano de Refeições

# qaScheduleThisRecipe
source: Schedule this recipe for a meal
pt: Agendar esta receita para uma refeição

# qaShareRecipe
source: Share Recipe
pt: Compartilhar Receita

# qaShareWithFriends
source: Share with friends and family
pt: Enviar para amigos e família

# qaSimilarRecipes
source: Similar Recipes
pt: Receitas Similares

# qaFindSimilar
source: Find similar recipes
pt: Encontrar receitas parecidas

# filtersTitle
source: Filters
pt: Filtros

source: Clear all
pt: Limpar Tudo

source: Apply
pt: Aplicar

source: Meal Type
pt: Tipo de Refeição

source: Dietary Restrictions
pt: Restrições Alimentares

source: Prep Time
pt: Tempo de Preparo

source: Calories
pt: Calorias

# dietVegetarian
source: Vegetarian
pt: Vegetariano

# dietVegan
source: Vegan
pt: Vegano

# dietGlutenFree
source: Gluten-Free
pt: Sem Glúten

# searchRecipesHint
source: Search recipes...
pt: Buscar receitas...

# dashboardSummary
source: Summary
pt: Resumo

# dashboardDetails
source: Details
pt: Detalhes

# dashboardWeek
source: Week
pt: Semana

# dashboardNutrition
source: Nutrition
pt: Nutrição

source: Dismiss today
pt: Dispensar hoje

# notesTitle
source: Notes
pt: Anotações

source: Add note
pt: Adicionar anotação

# addNoteHint
source: Open editor to create today's note
pt: Abre editor para criar nova anotação do dia

# todayNotesCount
source: Today: {count} note(s)
pt: Hoje: {count} anotação(ões)

source: Add body metrics
pt: Adicionar valores corporais

source: No entry today - tap to log
pt: Sem registro hoje - toque para registrar

source: No meals to duplicate today
pt: Sem refeições para duplicar hoje

# duplicateLastMealTitle
source: Duplicate last meal
pt: Duplicar última refeição

# mealDuplicated
source: Meal duplicated ({meal})
pt: Refeição duplicada ({meal})

# goalsPerMealTitle
source: Goals per meal
pt: Metas por refeição

source: Goals per meal updated
pt: Metas por refeição atualizadas

# remainingPlural
source: Remaining
pt: Restantes

# remainingGrams
source: Remaining: {grams}g
pt: Restante: {grams}g

source: Duplicate
pt: Duplicar

# duplicateDayTomorrowTitle
source: Duplicate day → tomorrow
pt: Duplicar dia → amanhã

# duplicateDayPickDateTitle
source: Duplicate day → pick date
pt: Duplicar dia → escolher data

# duplicateNewPickDateTitle
source: Duplicate "new" → pick date
pt: Duplicar "novos" → escolher data

source: No "new" items to duplicate
pt: Nenhum item "novo" para duplicar

# selectItemsToDuplicateTitle
source: Select items to duplicate
pt: Selecionar itens para duplicar

source: Choose file (.csv)
pt: Escolher arquivo (.csv)

# reviewItemsTitle
source: Review items
pt: Revisar itens

source: Add selected
pt: Adicionar selecionados

source: Save and add
pt: Salvar e adicionar

# detectFoodHeadline
source: Detect Food with AI
pt: Detectar Alimentos com IA

# detectFoodSubtitle
source: Capture a photo or pick from gallery to automatically identify foods and their nutrition
pt: Capture uma foto ou selecione da galeria para identificar automaticamente os alimentos e suas informações nutricionais

source: Take Photo
pt: Tirar Foto

source: Gallery
pt: Galeria

source: Initializing camera...
pt: Inicializando câmera...

# detectionTipsTitle
source: Tips for better detection:
pt: Dicas para melhor detecção:

# detectionTip1
source: Make sure lighting is good
pt: Certifique-se de ter boa iluminação

# detectionTip2
source: Shoot foods close up
pt: Fotografe os alimentos de perto

# detectionTip3
source: Avoid shadows on the plate
pt: Evite sombras no prato

# detectionTip4
source: One food at a time works best
pt: Um alimento por vez funciona melhor

# onePortion
source: 1 portion
pt: 1 porção

# itemsAdded
source: {count} item(s) added
pt: {count} item(ns) adicionados

source: Portion applied
pt: Porção aplicada

# addedToDiaryWithMeal
source: Added to diary ({meal})
pt: Adicionado ao diário ({meal})

source: Changes saved
pt: Alterações salvas

# saveChangesWithMeal
source: Save changes - {meal}
pt: Salvar alterações - {meal}

# addToDiaryWithMeal
source: Add to diary - {meal}
pt: Adicionar ao diário - {meal}

source: Added to My Foods
pt: Adicionado em Meus Alimentos

source: Add to My Foods
pt: Adicionar aos meus alimentos

# noMyFoodsTitle
source: You don't have My Foods yet
pt: Você ainda não tem Meus Alimentos

# presetsHelp
source: Open a food's details and tap "Add to My Foods" to create your presets.
pt: Abra os detalhes de um alimento e toque em "Adicionar aos meus alimentos" para criar seus presets.

# portionSizeGramsLabel
source: Portion size (g)
pt: Tamanho da porção (g)

source: grams
pt: gramas

# caloriesLabel
source: Calories
pt: Calorias

# carbsLabel
source: Carbohydrates
pt: Carboidratos

# proteinLabel
source: Protein
pt: Proteína

# fatLabel
source: Fat
pt: Gordura

# genericBrand
source: Generic
pt: Genérico

# addWithCalories
source: Add - {kcal} kcal
pt: Adicionar - {kcal} kcal

source: Analyzing foods...
pt: Analisando alimentos...

# pleaseWait
source: Please wait a few seconds
pt: Aguarde alguns segundos

source: Retake photo
pt: Nova foto

source: No food detected
pt: Nenhum alimento detectado

# tryCloserPhoto
source: Try taking a closer photo of the food
pt: Tente tirar uma foto mais próxima do alimento

source: Detected Foods
pt: Alimentos Detectados

source: Add or edit
pt: Adicionar ou editar

# addedShort
source: Added!
pt: Adicionado!

# noFoodDetectedInImage
source: No food detected in the image
pt: Nenhum alimento detectado na imagem

# saveAsMyFoodOptional
source: Save as My Food (optional label)
pt: Salvar como alimento (rótulo opcional)

source: Copy
pt: Copiar

source: Import day CSV
pt: Importar CSV do dia

# clearDayBeforeApply
source: Clear day before applying
pt: Limpar dia antes de aplicar

source: untitled
pt: sem nome

source: Duplicate new → pick date
pt: Duplicar novos → escolher data

# dayDuplicatedTo
source: Day duplicated to {date}
pt: Dia duplicado para {date}

# exerciseAdded100
source: Exercise logged: +100 kcal
pt: Exercício registrado: +100 kcal

# waterAdjustedMinus250
source: Water adjusted: -250ml (total {total}ml)
pt: Água ajustada: -250ml (total {total}ml)

# weekDuplicatedNext
source: Week duplicated to next
pt: Semana duplicada para a próxima

# weekDuplicatedToStart
source: Week duplicated to start on {date}
pt: Semana duplicada para iniciar em {date}

# noItemsThisMeal
source: No items in this meal
pt: Sem itens nesta refeição

# tapAddToLog
source: Tap + Add to quickly log foods.
pt: Toque em + Adicionar para registrar alimentos rapidamente.

source: View day
pt: Ver dia

source: Only new
pt: Somente novos

source: Day CSV downloaded
pt: CSV do dia baixado

source: Day CSV copied
pt: CSV do dia copiado

source: Day template saved
pt: Template de dia salvo

source: No day templates saved
pt: Nenhum template de dia salvo

source: Template name
pt: Nome do template

source: Week template saved
pt: Template de semana salvo

source: No week templates saved
pt: Nenhum template de semana salvo

source: Yesterday
pt: Ontem

# fatAbbrPlus
source: Fat+
pt: Gord+

# activitiesTitle
source: Activities
pt: Atividades

source: More
pt: Mais

# noActivitiesToday
source: No activities logged today
pt: Nenhuma atividade registrada hoje

source: Add exercise
pt: Adicionar exercício

# areYouSureStopFasting
source: Are you sure you want to stop your current fast? Your progress will be saved.
pt: Tem certeza que deseja interromper seu jejum atual? Seu progresso será salvo.

source: Stop Fasting
pt: Parar Jejum

source: Start Fasting
pt: Iniciar Jejum

source: Open filters
pt: Abrir filtros

source: Details
pt: Detalhes

source: Add to diary
pt: Adicionar ao diário

# prepMode
source: Preparation
pt: Modo de preparo

# prepDetailsUnavailable
source: Preparation details are not available in this mock version.
pt: Detalhes de preparo não disponíveis nesta versão (mock).

source: PRO Recipe
pt: Receita PRO

source: Tap to unlock
pt: Toque para desbloquear

source: PRO Only
pt: Somente PRO

# qaAddMeal
source: Add Meal
pt: Adicionar Refeição

# qaLogWater
source: Log Water
pt: Registrar Água

# qaExercise
source: Exercise
pt: Exercício

# qaProgress
source: Progress
pt: Progresso

# qaRecipes
source: Recipes
pt: Receitas

# qaSetupGoals
source: Setup Goals
pt: Configurar Metas

source: Feature in development
pt: Funcionalidade em desenvolvimento

# enterEmail
source: Enter your email
pt: Digite seu email

source: Password
pt: Senha

# enterPassword
source: Enter your password
pt: Digite sua senha

# emailRequired
source: Email is required
pt: Email é obrigatório

# emailInvalid
source: Invalid email
pt: Email inválido

# passwordRequired
source: Password is required
pt: Senha é obrigatória

# passwordMinLength
source: Password must be at least 6 characters
pt: Senha deve ter pelo menos 6 caracteres

# forgotPassword
source: Forgot my password?
pt: Esqueci minha senha?

source: Login
pt: Entrar

source: New user?
pt: Novo usuário?

# register
source: Sign up
pt: Cadastre-se

# registerScreenInDevelopment
source: Registration screen in development
pt: Tela de cadastro em desenvolvimento

source: Logout
pt: Sair

source: Clear
pt: Limpar

source: Import
pt: Importar

source: My progress
pt: Meu progresso

source: My goals
pt: Meus objetivos

source: Diet
pt: Alimentação

source: Standard
pt: Padrão

source: Weight goal
pt: Objetivo de peso

source: Lose
pt: Perder

source: Maintain
pt: Manter

source: Gain
pt: Ganhar

# initialWeight
source: Initial weight (kg)
pt: Peso inicial (kg)

# targetWeight
source: Target weight (kg)
pt: Meta de peso (kg)

source: Edit goals
pt: Editar objetivos

source: Goals updated
pt: Objetivos atualizados

# carbs
source: Carbohydrates
pt: Carboidratos

source: Proteins
pt: Proteínas

source: Fats
pt: Gorduras

source: Confirm
pt: Confirmar

# validCaloriesRequired
source: Enter valid calories (> 0)
pt: Informe calorias válidas (> 0)

# validMacrosRequired
source: Macros must be numbers ≥ 0)
pt: Macros devem ser números ≥ 0

source: Weight
pt: Peso

source: Height
pt: Altura

source: Body fat
pt: Gordura

source: Body Metrics
pt: Valores Corporais

# proPlanPersonalized
source: Personalized plans
pt: Planos personalizados

# proPlanPersonalizedDesc
source: Meal plans and fasting cycles adjusted to your goals.
pt: Cardápios e ciclos de jejum ajustados às suas metas.

# proSmartScanner
source: Smart scanner
pt: Scanner inteligente

# proSmartScannerDesc
source: Barcode + OCR to log meals in seconds.
pt: Barcode + OCR para lançar refeições em segundos.

# proAdvancedInsights
source: Advanced insights
pt: Insights avançados

# proAdvancedInsightsDesc
source: Predictive reports and automatic goal adjustments.
pt: Relatórios preditivos e ajustes automáticos de meta.

# proExclusiveRecipes
source: Exclusive recipes
pt: Receitas exclusivas

# proExclusiveRecipesDesc
source: PRO collection with calculated macros and advanced filters.
pt: Coleção PRO com macros calculados e filtros avançados.

source: Cancel anytime
pt: Cancele quando quiser

# dayGuarantee
source: 7-day guarantee
pt: 7 dias de garantia

# averageRating
source: Average rating 4.8/5
pt: Avaliação média 4,8/5

# noPlansAvailable
source: No plans available at the moment. Try again later.
pt: Nenhum plano disponível no momento. Tente novamente mais tarde.

# errorLoadingPlans
source: Error loading plans. Check your connection.
pt: Erro ao carregar planos. Verifique sua conexão.

# proActivated
source: PRO subscription activated successfully!
pt: Assinatura PRO ativada com sucesso!

source: Cancel PRO
pt: Encerrar PRO

source: Keep PRO
pt: Manter PRO

# cancelProTestMode
source: Cancel PRO (test environment)
pt: Cancelar PRO (ambiente de testes)

source: Free plan reactivated
pt: Plano gratuito reativado

source: Explore PRO benefits
pt: Explorar benefícios PRO

source: Restore Purchases
pt: Restaurar Compras

source: Reduce animations
pt: Reduzir animações

# reduceAnimationsDesc
source: Avoids confetti/exaggerated transitions
pt: Evita confetes/transições exageradas

source: Animations reduced
pt: Animações reduzidas

# animationsNormal
source: Normal animations
pt: Animações normais

source: Celebrate achievements
pt: Celebrar conquistas

# celebrateAchievementsDesc
source: Shows confetti when unlocking badges
pt: Mostra confete ao desbloquear badges

source: Celebrations disabled
pt: Celebrações desativadas

source: Celebrations enabled
pt: Celebrações ativadas

# showNextMilestone
source: Show 'Next milestone' in chips
pt: Exibir 'Próximo marco' nos chips

# showNextMilestoneDesc
source: Shows '• next: Nd' in streak chips
pt: Mostra '• próx: Nd' nos chips de streak

source: Use Lottie in celebrations
pt: Usar Lottie nas celebrações

source: Search and foods
pt: Busca e alimentos

# interpretQuantitiesNLQ
source: Interpret quantities in text (NLQ)
pt: Interpretar quantidades no texto (NLQ)

source: Collapse
pt: Recolher

source: Expand
pt: Expandir

source: Breakfast
pt: Café da manhã

source: Lunch
pt: Almoço

source: Dinner
pt: Jantar

source: Snacks
pt: Lanches

source: Export JSON
pt: Exportar JSON

source: Import JSON
pt: Importar JSON

source: Clear templates
pt: Limpar templates

source: Clear foods
pt: Limpar alimentos

# knowProNutriTracker
source: Know NutriTracker PRO
pt: Conheça o NutriTracker PRO

source: Friends
pt: Amigos

source: ANALYSIS
pt: ANÁLISE

source: REGISTER WEIGHT
pt: REGISTRAR PESO

source: DEFINE GOAL
pt: DEFINIR META

source: EDIT
pt: EDITAR

source: Diet: {type}
pt: Alimentação: {type}

source: Goal: {objective}
pt: Objetivo: {objective}
